#coding:utf-8
GENDER = (
        (0,u'男'),
        (1,u'女'),
        )

EDUCATION = (
        (0,u'本科'),
        (1,u'研究生'),
        )
VERIFY_PROCESS = (
        (0,u'未申请认证'),
        (1,u'正在审核'),
        (2,u'审核已通过'),
        (3,u'审核未通过'),
        )
QUESTION_TYPE = (
        (0,u'企业党建'),
        (1,u'技改创新及企业培训'),
        (2,u'软件和信息产业'),
        (3,u'融资及小企业认证'),
        (4,u'专精特新及清洁生产'),
        )
PROCESS_TYPE = (
        ('join',u'我要入党'),
        ('setup',u'我要成立党支部'),
        ('record',u'党组织关系转移'),
        )
PARTY_ATTRIBUTE = (
        (1,u'党委'),        
        (2,u'党总支部'),        
        (3,u'党支部'),        
        (4,u'联合党支部'),        
        ) 
INDUSTRY_NATURE = (
        (1,u'内资企业'),        
        (2,u'港澳台投资企业'),        
        (3,u'外商投资企业'),        
        ) 
NATURE_CHOICES = (
        (1,u'国有企业'),
        (2,u'国有联营企业'),
        (3,u'集体企业'),
        (4,u'私营企业'),
        (5,u'中外合资企业'),
        (6,u'外资独资企业'),
        (7,u'其他'),
        )
ENTER_SCALE = (
        (1,u'大型(500人及以上)'),        
        (2,u'中型(100-500人)'),        
        (3,u'小型(100人及以下)'),        
        ) 
TOTAL_ASSETS = (
        (1,u'2000万以上'),        
        (2,u'100万-2000万'),        
        (3,u'100万以下'),        
        ) 
INDUSTRY_TYPE = (
        (1,u'农林牧渔'),        
        (2,u'服务业'),        
        (3,u'科研院所'),        
        (4,u'制造业'),        
        (5,u'金融业'),        
        (6,u'建筑业'),        
        (7,u'房地产业'),        
        (8,u'计算机软件业'),        
        ) 


NATION = (
    (1,u'汉族'),
    (2,u'蒙古族'),
    (3,u'回族'),
    (4,u'藏族'),
    (5,u'维吾尔族'),
    (6,u'苗族'),
    (7,u'彝族'),
    (8,u'壮族'),
    (9,u'布依族'),
    (10,u'朝鲜族'),
    (11,u'满族'),
    (12,u'侗族'),
    (13,u'瑶族'),
    (14,u'白族'),
    (15,u'土家族'),
    (16,u'哈尼族'),
    (17,u'哈萨克族'),
    (18,u'傣族'),
    (19,u'黎族'),
    (20,u'傈僳族'),
    (21,u'佤族'),
    (22,u'畲族'),
    (23,u'高山族'),
    (24,u'拉祜族'),
    (25,u'水族'),
    (26,u'东乡族'),
    (27,u'纳西族'),
    (28,u'景颇族'),
    (29,u'柯尔克孜族'),
    (30,u'土族'),
    (31,u'达斡尔族'),
    (32,u'仫佬族'),
    (33,u'羌族'),
    (34,u'布朗族'),
    (35,u'撒拉族'),
    (36,u'毛难族'),
    (37,u'仡佬族'),
    (38,u'锡伯族'),
    (39,u'阿昌族'),
    (40,u'普米族'),
    (41,u'塔吉克族'),
    (42,u'怒族'),
    (43,u'乌孜别克族'),
    (44,u'俄罗斯族'),
    (45,u'鄂温克族'),
    (46,u'崩龙族'),
    (47,u'保安族'),
    (48,u'裕固族'),
    (49,u'京族'),
    (50,u'塔塔尔族'),
    (51,u'独龙族'),
    (52,u'鄂伦春族'),
    (53,u'赫哲族'),
    (54,u'门巴族'),
    (55,u'珞巴族'),
    (56,u'基诺族'),
    )
